## Plan Result (prod)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.azurekeyvault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.azurekeyvault.azurerm_user_assigned_identity.managed_identity[0]
* Update
  * module.azurekeyvault.azurerm_key_vault_access_policy.creator_access_policy
  * module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.azurekeyvault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-neuvector-prod-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-prod/objectId/98053eb3-8523-4c5a-96d3-c15532f87c19"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-neuvector-prod-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-prod"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-neuvector-prod-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-prod|cftneuvector-prod"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "cftneuvector-prod"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.azurekeyvault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "neuvector-prod-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-prod-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":13,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->